PKH0124/Toilet-alarm/代码/警报器/bsp/ht32/ht32f52352/sttbsp/bsp_lora.h
#ifndef __BSP_LORA_H__
#define __BSP_LORA_H__
 
#include "ht32.h"

#define BSP_LORA_MAX_LEN (200)/*最大缓存长度*/

#define BSP_LORA (HT_UART0)

#define BSP_LORA_CLK(CK) (CKCUClock.Bit.UART0)

#define BSP_LORA_AFIO 	(GPIO_PB)
#define BSP_LORA_AFIO_TX	(AFIO_PIN_2)
#define BSP_LORA_AFIO_RX	(AFIO_PIN_3)

#define BSP_LORA_GPIO 	(HT_GPIOC)
#define	BSP_LORA_GPIO_RES	(GPIO_PIN_8)

#define BSP_LORA_IRQHANDLER (UART0_IRQHandler)/*接收中断函数*/
#define BSP_LORA_IRQN (UART0_IRQn)

/*lora中断缓存结构体*/
typedef struct BSP_LORA_USART {
    char buffer[BSP_LORA_MAX_LEN];
    int length;
		u8 overflag;
}BSP_LORA_USART;

extern BSP_LORA_USART	s_bsp_lora_rx;

void Bsp_Lora_Res_Config(void);
void Bsp_Lora_Res(void);
void Bsp_Lora_Usart_Config(void);
void Bsp_Lora_Sendbyte(char Data);
void Bsp_Lora_SendArray(char array[],uint8_t num);
void Bsp_Lora_SendStr(char *str);
void Bsp_Lora_Printf(char* fmt,...);
void Bsp_Lora_Clear_Struct(void);
void Bsp_Lora_Switch_Overflag(u8 flag);
int32_t Bsp_Lora_Send_Cmd(char* cmd, char* reply, uint32_t wait);


#endif
